In [27]:
import pandas as pd

In [28]:
data={'Students':['Jisoo','Jennie','Lalisa','Rose','Suzy','IU'],
'Marks':[85,None,65,75,None,55]}

In [29]:
df=pd.DataFrame(data)
print('Original Data')
df

Original Data

  Students  Marks
0    Jisoo   85.0
1   Jennie    NaN
2   Lalisa   65.0
3     Rose   75.0
4     Suzy    NaN
5       IU   55.0

In [30]:
print('Missing Data')
print('Number of Missing values are: ',df.isnull().sum())

Missing Data
Number of Missing values are:  Students    0
Marks       2
dtype: int64

In [31]:
average_marks=(df['Marks'].mean())
print(average_marks)

70.0

In [32]:
df.fillna(average_marks, inplace=True)

In [33]:
print('after fillna() call')
df

after fillna() call

  Students  Marks
0    Jisoo   85.0
1   Jennie   70.0
2   Lalisa   65.0
3     Rose   75.0
4     Suzy   70.0
5       IU   55.0

In [34]:
studentsdata={'Students':['Jisoo','Jennie','Lalisa','Rose','Suzy','IU'],
'Marks':[85,None,65,75,None,55]}
df=pd.DataFrame(studentsdata)
print('Original Data')
df

Original Data

  Students  Marks
0    Jisoo   85.0
1   Jennie    NaN
2   Lalisa   65.0
3     Rose   75.0
4     Suzy    NaN
5       IU   55.0

In [35]:
df.fillna(df['Marks'].mean(), inplace=True)

In [36]:
print('After Cleaning Data')
df

After Cleaning Data

  Students  Marks
0    Jisoo   85.0
1   Jennie   70.0
2   Lalisa   65.0
3     Rose   75.0
4     Suzy   70.0
5       IU   55.0

# Dropna Example

In [37]:
studentsdata={'Students':['Jisoo','Jennie','Lalisa','Rose','Suzy','IU'],
'Marks':[85,None,65,75,None,55]}
df=pd.DataFrame(studentsdata)
print('Original Data')
df

Original Data

  Students  Marks
0    Jisoo   85.0
1   Jennie    NaN
2   Lalisa   65.0
3     Rose   75.0
4     Suzy    NaN
5       IU   55.0

In [41]:
df=df.dropna()

In [42]:
print('Dataset after dropna()')
df

Dataset after dropna()

  Students  Marks
0    Jisoo   85.0
2   Lalisa   65.0
3     Rose   75.0
5       IU   55.0

In [43]:
emp_data={
    'Name':['Bae Suzy','IU','Jisoo','V','WuBin','Anna'],
    'Age':[30,None,35,30,50,None],
    'Salary':[50000,30000,35000,55000,None,None],
}

In [46]:
df=pd.DataFrame(emp_data)
print('Original Data')
df

Original Data

       Name   Age   Salary
0  Bae Suzy  30.0  50000.0
1        IU   NaN  30000.0
2     Jisoo  35.0  35000.0
3         V  30.0  55000.0
4     WuBin  50.0      NaN
5      Anna   NaN      NaN

In [47]:
print(df.isnull().sum())

Name      0
Age       2
Salary    2
dtype: int64

In [48]:
df_drop=df.dropna()
df_drop

       Name   Age   Salary
0  Bae Suzy  30.0  50000.0
2     Jisoo  35.0  35000.0
3         V  30.0  55000.0

In [49]:
df_drop_salary=df.dropna(subset=['Salary'])
df_drop_salary

       Name   Age   Salary
0  Bae Suzy  30.0  50000.0
1        IU   NaN  30000.0
2     Jisoo  35.0  35000.0
3         V  30.0  55000.0

In [54]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())
df

       Name    Age   Salary
0  Bae Suzy  30.00  50000.0
1        IU  36.25  30000.0
2     Jisoo  35.00  35000.0
3         V  30.00  55000.0
4     WuBin  50.00  42500.0
5      Anna  36.25  42500.0

In [60]:
emp_data={
    'Name':['Bae Suzy','IU','Jisoo','V','WuBin','Anna'],
    'Age':[30,None,35,30,50,None],
    'Salary':[50000,30000,35000,55000,None,None],
}
df=pd.DataFrame(emp_data)
df.fillna({'Age':df['Age'].mean(),'Salary':df['Salary'].mean()}, inplace=True)
df

       Name    Age   Salary
0  Bae Suzy  30.00  50000.0
1        IU  36.25  30000.0
2     Jisoo  35.00  35000.0
3         V  30.00  55000.0
4     WuBin  50.00  42500.0
5      Anna  36.25  42500.0

Download students performance csv
find out number of missing data
drop rows where gender is missing
fill study_hours with average study_hours

In [62]:
df = pd.read_csv('students_performance_dirty.csv')

In [63]:
print("Missing data per column:")
print(df.isnull().sum())

Missing data per column:
gender            8
study_hours       8
attendance_pct    0
math_score        0
reading_score     0
final_score       0
dtype: int64

In [69]:
df = df.dropna(subset=['gender'])
df.head(5)

   gender  study_hours  attendance_pct  math_score  reading_score  final_score
0    male          1.7            83.6        62.0           91.0         38.9
2  female          2.9            97.5        69.0           57.0         35.0
3  female          4.8            85.7        78.0           62.0         36.5
4    male          3.9           -10.0        64.0           95.0         30.9
5    male          1.4            93.7        77.0           72.0         39.0

In [70]:
df['study_hours'] = df['study_hours'].fillna(df['study_hours'].mean())
df.head(5)

   gender  study_hours  attendance_pct  math_score  reading_score  final_score
0    male          1.7            83.6        62.0           91.0         38.9
2  female          2.9            97.5        69.0           57.0         35.0
3  female          4.8            85.7        78.0           62.0         36.5
4    male          3.9           -10.0        64.0           95.0         30.9
5    male          1.4            93.7        77.0           72.0         39.0

In [71]:
print(df.isnull().sum())

gender            0
study_hours       0
attendance_pct    0
math_score        0
reading_score     0
final_score       0
dtype: int64